ETL PIPELINE

Create a pandas DataFrame from the CSV and from Python lists/dicts

In [1]:
import pandas as pd

In [2]:
data=pd.read_csv(r'C:\Users\frootie\OneDrive\Desktop\CHUBB Training\transactions_1000_dataset.csv')

In [3]:
type(data)

pandas.core.frame.DataFrame

In [4]:
data.head()

,transaction_id,store_id,store_name,date,product_id,product_name,quantity,unit_price,total,customer_id,promo_code
0,1001,2,Suburb,2025-10-24,502,Pen,2,7.10,14.20,2086,OFFER20
1,1002,2,Suburb,2025-10-15,503,Stapler,9,3.03,27.27,2256,NaN
2,1003,1,Downtown,2025-10-18,505,Marker,3,0.78,2.34,2459,DISC5
3,1004,2,Suburb,2025-10-05,506,Highlighter,9,0.91,8.19,2403,NaN
4,1005,3,Airport,2025-10-18,506,Highlighter,3,5.06,15.18,2204,NaN

In [5]:
data.head(-5)

,transaction_id,store_id,store_name,date,product_id,product_name,quantity,unit_price,total,customer_id,promo_code
0,1001,2,Suburb,2025-10-24,502,Pen,2,7.10,14.20,2086,OFFER20
1,1002,2,Suburb,2025-10-15,503,Stapler,9,3.03,27.27,2256,NaN
2,1003,1,Downtown,2025-10-18,505,Marker,3,0.78,2.34,2459,DISC5
3,1004,2,Suburb,2025-10-05,506,Highlighter,9,0.91,8.19,2403,NaN
4,1005,3,Airport,2025-10-18,506,Highlighter,3,5.06,15.18,2204,NaN
...,...,...,...,...,...,...,...,...,...,...,...
990,1991,3,Airport,2025-10-19,505,Marker,5,0.73,3.65,2327,NaN
991,1992,2,Suburb,2025-10-04,501,Notebook,8,2.53,20.24,2044,DISC5
992,1993,2,Suburb,2025-10-26,501,Notebook,6,3.29,19.74,2149,DISC10
993,1994,1,Downtown,2025-10-26,506,Highlighter,9,1.22,10.98,2018,OFFER20
994,1995,1,Downtown,2025-10-09,504,Folder,5,9.81,49.05,2288,NaN

In [6]:
dat={"transaction_id":996,"store_id":3,"store_name":"Suburb","date":2025-11-13,"product_name":"Ipad","quantity":0,"unit_price":1000,"total":0,"customer_id":2000}
type(dat)

dict

In [7]:
dat=pd.DataFrame([dat])

In [8]:
type(dat)

pandas.core.frame.DataFrame

Dataframe from lists

In [9]:
transaction_id = [1, 2, 3]
store_id = [101, 102, 103]
store_name = ["Suburb", "Downtown", "Airport"]
date = ["2025-11-10", "2025-11-11", "2025-11-12"]
product_id = [501, 502, 503]
product_name = ["Laptop", "Headphones", "Mouse"]
quantity = [1, 2, 3]
unit_price = [1000, 50, 20]
total = [1000, 100, 60]
customer_id = [2001, 2002, 2003]
promo_code = ["PROMO10", None, "SALE5"]
datalist = pd.DataFrame({
    "transaction_id": transaction_id,
    "store_id": store_id,
    "store_name": store_name,
    "date": date,
    "product_id": product_id,
    "product_name": product_name,
    "quantity": quantity,
    "unit_price": unit_price,
    "total": total,
    "customer_id": customer_id,
    "promo_code": promo_code
})

In [10]:
datalist

,transaction_id,store_id,store_name,date,product_id,product_name,quantity,unit_price,total,customer_id,promo_code
0,1,101,Suburb,2025-11-10,501,Laptop,1,1000,1000,2001,PROMO10
1,2,102,Downtown,2025-11-11,502,Headphones,2,50,100,2002,None
2,3,103,Airport,2025-11-12,503,Mouse,3,20,60,2003,SALE5

Dataframe from dictionary

In [11]:
datadict = {
    "transaction_id": [4, 5, 6],
    "store_id": [101, 103, 102],
    "store_name": ["Suburb", "Airport", "Downtown"],
    "date": ["2025-11-13", "2025-11-14", "2025-11-15"],
    "product_id": [504, 505, 506],
    "product_name": ["Tablet", "Charger", "Camera"],
    "quantity": [2, 1, 4],
    "unit_price": [300, 20, 500],
    "total": [600, 20, 2000],
    "customer_id": [2004, 2005, 2006],
    "promo_code": ["PROMO20", "SALE5", None]
}

datadict = pd.DataFrame(datadict)
print(datadict)

   transaction_id  store_id store_name        date  product_id product_name  \
0               4       101     Suburb  2025-11-13         504       Tablet
1               5       103    Airport  2025-11-14         505      Charger
2               6       102   Downtown  2025-11-15         506       Camera

   quantity  unit_price  total  customer_id promo_code
0         2         300    600         2004    PROMO20
1         1          20     20         2005      SALE5
2         4         500   2000         2006       None

Filter and subset rows/columns (e.g., sales for a store, date ranges, high-value transactions).

In [12]:
data = pd.concat([data, dat])

In [13]:
data.head(-5)

,transaction_id,store_id,store_name,date,product_id,product_name,quantity,unit_price,total,customer_id,promo_code
0,1001,2,Suburb,2025-10-24,502.0,Pen,2,7.10,14.20,2086,OFFER20
1,1002,2,Suburb,2025-10-15,503.0,Stapler,9,3.03,27.27,2256,NaN
2,1003,1,Downtown,2025-10-18,505.0,Marker,3,0.78,2.34,2459,DISC5
3,1004,2,Suburb,2025-10-05,506.0,Highlighter,9,0.91,8.19,2403,NaN
4,1005,3,Airport,2025-10-18,506.0,Highlighter,3,5.06,15.18,2204,NaN
...,...,...,...,...,...,...,...,...,...,...,...
991,1992,2,Suburb,2025-10-04,501.0,Notebook,8,2.53,20.24,2044,DISC5
992,1993,2,Suburb,2025-10-26,501.0,Notebook,6,3.29,19.74,2149,DISC10
993,1994,1,Downtown,2025-10-26,506.0,Highlighter,9,1.22,10.98,2018,OFFER20
994,1995,1,Downtown,2025-10-09,504.0,Folder,5,9.81,49.05,2288,NaN
995,1996,2,Suburb,2025-10-12,502.0,Pen,2,9.68,19.36,2265,NaN

In [14]:
data.iloc[-1]

transaction_id       996
store_id               3
store_name        Suburb
date                2001
product_id           NaN
product_name        Ipad
quantity               0
unit_price        1000.0
total                0.0
customer_id         2000
promo_code           NaN
Name: 0, dtype: object

In [15]:
store_sales=data.groupby("store_id")["total"].sum()
print(f"Store sales {store_sales}")

Store sales store_id
1     8437.07
2     9262.91
3    11157.01
Name: total, dtype: float64

In [16]:
data.loc[:, "date"]

0      2025-10-24
1      2025-10-15
2      2025-10-18
3      2025-10-05
4      2025-10-18
          ...
996    2025-10-13
997    2025-10-05
998    2025-10-15
999    2025-10-18
0            2001
Name: date, Length: 1001, dtype: object

In [17]:
data["date"] = pd.to_datetime(data["date"], errors="coerce")

In [18]:
date_ranges = data[(data["date"] >= "2025-10-10") & (data["date"] <= "2025-11-10")]

In [19]:
print(f"Transaction total among date ranges {date_ranges["total"].sum()}")

Transaction total among date ranges 19332.280000000002

In [20]:
high_value= data.loc[data["total"] > 50, ["transaction_id","total","store_id", "store_name"]]
print(f"High Value Transaction \n{high_value}")

High Value Transaction
     transaction_id  total  store_id store_name
6              1007  65.80         3    Airport
7              1008  50.76         3    Airport
8              1009  81.27         3    Airport
14             1015  50.60         3    Airport
16             1017  59.76         2     Suburb
..              ...    ...       ...        ...
967            1968  78.39         3    Airport
970            1971  71.60         1   Downtown
978            1979  65.30         3    Airport
984            1985  55.09         3    Airport
999            2000  64.00         3    Airport

[185 rows x 4 columns]

Compute descriptive statistics and group summaries (totals by store, average basket).

In [21]:
means = data.groupby("product_id")["quantity"].mean()
print(f"Average quantity per product \n{means}")

Average quantity per product
product_id
501.0    5.262195
502.0    5.723926
503.0    5.891429
504.0    5.525714
505.0    5.343023
506.0    5.172185
Name: quantity, dtype: float64

In [22]:
data.loc[501.0]

transaction_id                   1502
store_id                            3
store_name                    Airport
date              2025-10-12 00:00:00
product_id                      501.0
product_name                 Notebook
quantity                            3
unit_price                       1.16
total                            3.48
customer_id                      2097
promo_code                        NaN
Name: 501, dtype: object

In [23]:
daily_total_sales=data.groupby("date")["total"].sum()

In [24]:
print(f"Daily total sales \n{daily_total_sales}")

Daily total sales
date
2025-10-01    1075.17
2025-10-02     926.31
2025-10-03     874.33
2025-10-04    1055.34
2025-10-05    1142.95
2025-10-06    1287.99
2025-10-07    1180.35
2025-10-08    1016.34
2025-10-09     965.93
2025-10-10     784.31
2025-10-11     977.80
2025-10-12     815.61
2025-10-13    1353.50
2025-10-14     924.39
2025-10-15     810.70
2025-10-16     729.80
2025-10-17     808.76
2025-10-18    1119.38
2025-10-19    1157.75
2025-10-20    1040.09
2025-10-21     610.20
2025-10-22     818.06
2025-10-23     821.95
2025-10-24    1017.18
2025-10-25     871.21
2025-10-26     778.15
2025-10-27    1214.86
2025-10-28    1200.71
2025-10-29     896.82
2025-10-30     581.05
Name: total, dtype: float64

In [25]:
total_by_store=data.groupby("store_id")["total"].sum()
print(f"Total sales by store \n{total_by_store}")

Total sales by store
store_id
1     8437.07
2     9262.91
3    11157.01
Name: total, dtype: float64

In [26]:
total_by_product=data.groupby("product_id")["total"].sum()
print(f" Total sales by product \n{total_by_product}")

 Total sales by product
product_id
501.0    4639.86
502.0    5155.57
503.0    5171.88
504.0    4982.09
505.0    4989.33
506.0    3918.26
Name: total, dtype: float64

Perform simple cleaning (handle missing values, fix data types, drop duplicates).

In [27]:
data.isna().sum()

transaction_id      0
store_id            0
store_name          0
date                1
product_id          1
product_name        0
quantity            0
unit_price          0
total               0
customer_id         0
promo_code        406
dtype: int64

In [28]:
data = data.dropna(subset=["quantity"])

In [29]:
data = data.dropna(subset=["date", "product_id"])

In [30]:
data["quantity"]

0       2
1       9
2       3
3       9
4       3
       ..
995     2
996    10
997     7
998     7
999     8
Name: quantity, Length: 1000, dtype: int64

In [31]:
data["promo_code"]

0      OFFER20
1          NaN
2        DISC5
3          NaN
4          NaN
        ...
995        NaN
996    OFFER20
997     DISC10
998        NaN
999    OFFER20
Name: promo_code, Length: 1000, dtype: object

In [32]:
data["promo_code"] = data["promo_code"].fillna(data["promo_code"].mode()[0])

In [33]:
data.head()

,transaction_id,store_id,store_name,date,product_id,product_name,quantity,unit_price,total,customer_id,promo_code
0,1001,2,Suburb,2025-10-24,502.0,Pen,2,7.10,14.20,2086,OFFER20
1,1002,2,Suburb,2025-10-15,503.0,Stapler,9,3.03,27.27,2256,DISC5
2,1003,1,Downtown,2025-10-18,505.0,Marker,3,0.78,2.34,2459,DISC5
3,1004,2,Suburb,2025-10-05,506.0,Highlighter,9,0.91,8.19,2403,DISC5
4,1005,3,Airport,2025-10-18,506.0,Highlighter,3,5.06,15.18,2204,DISC5

In [34]:
data.isna()

,transaction_id,store_id,store_name,date,product_id,product_name,quantity,unit_price,total,customer_id,promo_code
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
995,False,False,False,False,False,False,False,False,False,False,False
996,False,False,False,False,False,False,False,False,False,False,False
997,False,False,False,False,False,False,False,False,False,False,False
998,False,False,False,False,False,False,False,False,False,False,False
999,False,False,False,False,False,False,False,False,False,False,False

Build a mini ETL pipeline: read CSV → clean & transform → output JSON.
This whole excercise in an ETL pipeline

In [35]:
data["discounted_price"] = data["total"] * 0.90

In [36]:
data["discounted_price"]

0      12.780
1      24.543
2       2.106
3       7.371
4      13.662
        ...
995    17.424
996     8.100
997    25.452
998    17.073
999    57.600
Name: discounted_price, Length: 1000, dtype: float64

In [37]:
data["profit"] = data["total"] * 0.30

In [38]:
data["profit"]

0       4.260
1       8.181
2       0.702
3       2.457
4       4.554
        ...
995     5.808
996     2.700
997     8.484
998     5.691
999    19.200
Name: profit, Length: 1000, dtype: float64

In [39]:
product_sales= data.groupby("product_name")["total"].sum()
product_sales

product_name
Folder         4982.09
Highlighter    3918.26
Marker         4989.33
Notebook       4639.86
Pen            5155.57
Stapler        5171.88
Name: total, dtype: float64

In [40]:
import json
import datetime 
from pandas import Timestamp

In [41]:
def convert(obj):
    if isinstance(obj, (datetime.date, datetime.datetime)):
        return obj.isoformat()
    raise TypeError(f"Object of type {obj.__class__.__name__} is not JSON serializable")

In [42]:
daily_total_sales.index = daily_total_sales.index.astype(str)

In [46]:
sales_summary = {
    "store_sales": store_sales.to_dict(),
    "high_value_transactions": high_value.to_dict(orient="records"),
    "average_quantity_per_product": means.to_dict(),
    "product_sales": product_sales.to_dict(),
    "daily_total_sales": daily_total_sales.to_dict(),
    "total_by_store": total_by_store.to_dict(),
    "total_by_product": total_by_product.to_dict()
}
file_name = "sales_summary.json"
try:
    with open(file_name, "w") as json_file:
        json.dump(sales_summary, json_file, indent=4, default=convert)
    print(f"File successfully created: {file_name}")
except Exception as e:
    print(f"An error occurred while writing the file: {e}")

File successfully created: sales_summary.json

Complete a short hands-on test and an assignment to extend the pipeline.

In [44]:
print("Data shape before removing duplicates:", data.shape)
print("Number of duplicate rows found:", data.duplicated().sum())
data.drop_duplicates(inplace=True)
print("Data shape after removing duplicates:", data.shape)

Data shape before removing duplicates: (1000, 13)
Number of duplicate rows found: 0
Data shape after removing duplicates: (1000, 13)

In [45]:
topproducts= data.groupby('product_name')['quantity'].sum().nlargest(5)
print("\n Top 5 Products by Quantity Sold:")
print(topproducts)

 Top 5 Products by Quantity Sold:
product_name
Stapler     1031
Folder       967
Pen          933
Marker       919
Notebook     863
Name: quantity, dtype: int64